zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/radio/radio.c
static void mram_no_latency_callback(struct onoff_manager *mgr,
				     struct onoff_client *cli,
				     uint32_t state, int res)
{
	ARG_UNUSED(mgr);
	ARG_UNUSED(cli);

	LL_ASSERT_ERR(res == 0);
	LL_ASSERT_ERR(state == ONOFF_STATE_ON);

	/* There shall be an outstanding request to acknowledge */
	LL_ASSERT_ERR(mram_no_latency_start_ack != mram_no_latency_start_req);
	mram_no_latency_start_ack++;

	/* Count the requests and releases */
	uint8_t req = mram_no_latency_start_req - mram_no_latency_start_ack;
	uint8_t rel = mram_no_latency_stop_req - mram_no_latency_stop_ack;

	/* Reset requests and releases */
	mram_no_latency_start_ack = mram_no_latency_start_req;
	mram_no_latency_stop_ack = mram_no_latency_stop_req;

	/* Handle cancel or release */
	if (rel > req) {
		int ret;

		ret = mram_no_latency_cancel_or_release(&mram_cli);
		LL_ASSERT_ERR(ret == ONOFF_STATE_ON);
	} else {
		/* No cancel or release before this callback */
	}
}
#endif /* CONFIG_SOC_SERIES_NRF54H */

void radio_setup(void)
{
#if defined(HAL_RADIO_GPIO_HAVE_PA_PIN)
	NRF_GPIO_PA->DIRSET = BIT(NRF_GPIO_PA_PIN);
	if (ACTIVE_LOW(NRF_GPIO_PA_FLAGS)) {
		NRF_GPIO_PA->OUTSET = BIT(NRF_GPIO_PA_PIN);
	} else {
		NRF_GPIO_PA->OUTCLR = BIT(NRF_GPIO_PA_PIN);
	}
#endif /* HAL_RADIO_GPIO_HAVE_PA_PIN */

#if defined(HAL_RADIO_GPIO_HAVE_LNA_PIN)
	NRF_GPIO_LNA->DIRSET = BIT(NRF_GPIO_LNA_PIN);

	radio_gpio_lna_off();
#endif /* HAL_RADIO_GPIO_HAVE_LNA_PIN */

#if defined(NRF_GPIO_PDN_PIN)
	NRF_GPIO_PDN->DIRSET = BIT(NRF_GPIO_PDN_PIN);
	if (ACTIVE_LOW(NRF_GPIO_PDN_FLAGS)) {
		NRF_GPIO_PDN->OUTSET = BIT(NRF_GPIO_PDN_PIN);
	} else {
		NRF_GPIO_PDN->OUTCLR = BIT(NRF_GPIO_PDN_PIN);
	}
#endif /* NRF_GPIO_PDN_PIN */

	hal_radio_ram_prio_setup();
}

void radio_reset(void)
{

	/* nRF SoC generic radio reset/initializations
	 * Note: Only registers whose bits are partially modified across
	 *       functions are assigned back the power-on reset values.
	 *       Ignore other registers for reset which will have all bits
	 *       explicitly assigned by functions in this file.
	 */
	NRF_RADIO->PCNF1 = HAL_RADIO_RESET_VALUE_PCNF1;

#if defined(CONFIG_BT_CTLR_DF) && !defined(CONFIG_ZTEST)
	radio_df_reset();
#endif /* CONFIG_BT_CTLR_DF && !CONFIG_ZTEST */

	/* nRF SoC specific reset/initializations, if any */
	hal_radio_reset();

#if !defined(CONFIG_BT_CTLR_TIFS_HW)
	hal_radio_sw_switch_ppi_group_setup();
#endif

#if defined(CONFIG_SOC_COMPATIBLE_NRF54LX) || defined(CONFIG_SOC_SERIES_NRF54H)
#if defined(CONFIG_BT_CTLR_TIFS_HW)
	NRF_RADIO->TIMING = (RADIO_TIMING_RU_Legacy << RADIO_TIMING_RU_Pos) &
			    RADIO_TIMING_RU_Msk;
#else /* !CONFIG_BT_CTLR_TIFS_HW */
	NRF_RADIO->TIMING = (RADIO_TIMING_RU_Fast << RADIO_TIMING_RU_Pos) &
			    RADIO_TIMING_RU_Msk;
#endif /* !CONFIG_BT_CTLR_TIFS_HW */
#endif /* CONFIG_SOC_COMPATIBLE_NRF54LX || CONFIG_SOC_SERIES_NRF54H */

#if defined(CONFIG_SOC_COMPATIBLE_NRF54LX)
#if defined(CONFIG_NRF_SYS_EVENT)
	(void)nrf_sys_event_request_global_constlat();

#else /* !CONFIG_NRF_SYS_EVENT */
	/* Refer to nRF54L Product Specifications for below quirks.
	 * FIXME: Use on off service design to share these request with application implementations.
	 */
	/* Put RRAMC in Standby mode.
	 * Gives faster wake-ups, and is useful in combination with Constant Latency sub-power mode.
	 * FIXME: Use on off service design to share this request with application implementations.
	 */
	NRF_RRAMC->POWER.LOWPOWERCONFIG = (RRAMC_POWER_LOWPOWERCONFIG_MODE_Standby <<
					   RRAMC_POWER_LOWPOWERCONFIG_MODE_Pos) &
					  RRAMC_POWER_LOWPOWERCONFIG_MODE_Msk;

	/* Enable Constant Latency mode */
	NRF_POWER->TASKS_CONSTLAT = 1U;
#endif /* !CONFIG_NRF_SYS_EVENT */
#endif /* CONFIG_SOC_COMPATIBLE_NRF54LX */


#if defined(CONFIG_SOC_SERIES_NRF54H)
	atomic_val_t refcnt;

	/* Check and request mram no latency if we are the first instance */
	refcnt = atomic_inc(&mram_refcnt);
	if (refcnt == 0) {
		uint8_t old = mram_no_latency_start_req;
		uint8_t ack = mram_no_latency_start_ack;
		uint8_t req = old + 1U;

		/* Check rollover condition, which shall not happen by design */
		LL_ASSERT_ERR(req != ack);

		/* Mark for mram no latency requested */
		mram_no_latency_start_req = req;

		if (mram_no_latency_stop_req == mram_no_latency_stop_ack) {
			int ret;

			sys_notify_init_callback(&mram_cli.notify, mram_no_latency_callback);

			ret = mram_no_latency_request(&mram_cli);
			LL_ASSERT_ERR(ret >= 0);
		} else {
			/* We leave the request marked so that the callback will
			 * retain the mram_no_latency.
			 */
		}
	} else {
		/* Nothing to do, reference count increased. */
	}
#endif /* CONFIG_SOC_SERIES_NRF54H */

#if defined(HAL_RADIO_GPIO_HAVE_PA_PIN) || defined(HAL_RADIO_GPIO_HAVE_LNA_PIN)
	hal_palna_ppi_setup();
#endif
#if defined(HAL_RADIO_FEM_IS_NRF21540)
	hal_fem_ppi_setup();
#endif
}

void radio_stop(void)
{
	/* nRF SoC specific radio stop/cleanup, if any */
	hal_radio_stop();

	/* nRF SoC generic radio stop/cleanup
	 * TODO: Initialize NRF_RADIO registers used by Controller to power-on
	 *       reset values.
	 *       This is required in case NRF_RADIO is share/used between
	 *       Bluetooth radio events by application defined radio protocols.
	 *       The application too shall restore the registers it uses to the
	 *       power-on reset values once it has stopped using the radio.
	 *
	 *       Registers used for Bluetooth Low Energy Controller:
	 *       - MODE
	 *       - MODECNF0
	 *       - TXPOWER
	 *       - FREQUENCY
	 *       - DATAWHITEIV
	 *       - PCNF0
	 *       - PCNF1
	 *       - TXADDRESS
	 *       - RXADDRESSES
	 *       - PREFIX0
	 *       - BASE0
	 *       - PACKETPTR
	 *       - CRCCNF
	 *       - CRCPOLY
	 *       - CRCINIT
	 *       - DAB
	 *       - DAP
	 *       - DACNF
	 *       - BCC
	 *       - TIFS
	 *       - SHORTS
	 *
	 *       Additional registers used for Direction Finding feature:
	 *       - SWITCHPATTERN
	 *       - DFEMODE
	 *       - CTEINLINECONF
	 *       - DFECTRL1
	 *       - DEFCTRL2
	 *       - CLEARPATTERN
	 *       - PSEL.DFEGPIO[n]
	 *       - DFEPACKET.PTR
	 */

#if defined(CONFIG_SOC_SERIES_NRF54H)
	atomic_val_t refcnt;

	/* Check and request a cancel or release if we are the last instance */
	refcnt = atomic_get(&mram_refcnt);
	if (refcnt > 0) {
		refcnt = atomic_dec(&mram_refcnt);
		if (refcnt == 1) {
			uint8_t old = mram_no_latency_stop_req;
			uint8_t ack = mram_no_latency_stop_ack;
			uint8_t req = old + 1U;

			/* Mark for cancel or release being requested */
			LL_ASSERT_ERR(req != ack);
			mram_no_latency_stop_req = req;

			if (mram_no_latency_start_req == mram_no_latency_start_ack) {
				int ret;

				ret = mram_no_latency_cancel_or_release(&mram_cli);
				LL_ASSERT_ERR((ret == ONOFF_STATE_TO_ON) ||
					      (ret == ONOFF_STATE_ON));

				/* Unmark cancel or release, as its handled here
				 * with successful value being returned.
				 */
				mram_no_latency_stop_req = old;
			} else {
				/* Nothing to do, mram_no_latency not started
				 * yet, cancel or release will be performed in
				 * the callback when mram_no_latency is started.
				 */
			}
		} else {
			/* Nothing to do, reference count decremented. */
		}
	} else {
		/* NOTE: radio_stop() will be called more times than radio_reset
		 *       hence it is ok for the refcnt being zero.
		 */
	}
#endif /* CONFIG_SOC_SERIES_NRF54H */
}

void radio_phy_set(uint8_t phy, uint8_t flags)
{
	uint32_t mode;

	mode = hal_radio_phy_mode_get(phy, flags);

	NRF_RADIO->MODE = (mode << RADIO_MODE_MODE_Pos) & RADIO_MODE_MODE_Msk;

#if !defined(CONFIG_SOC_SERIES_NRF51) && !defined(CONFIG_SOC_COMPATIBLE_NRF54LX) && \
	!defined(CONFIG_SOC_SERIES_NRF54H)
#if defined(CONFIG_BT_CTLR_RADIO_ENABLE_FAST)
	NRF_RADIO->MODECNF0 = ((RADIO_MODECNF0_DTX_Center <<
				RADIO_MODECNF0_DTX_Pos) &
			       RADIO_MODECNF0_DTX_Msk) |
			      ((RADIO_MODECNF0_RU_Fast <<
				RADIO_MODECNF0_RU_Pos) &
			       RADIO_MODECNF0_RU_Msk);
#else /* !CONFIG_BT_CTLR_RADIO_ENABLE_FAST */
	NRF_RADIO->MODECNF0 = (RADIO_MODECNF0_DTX_Center <<
			       RADIO_MODECNF0_DTX_Pos) &
			      RADIO_MODECNF0_DTX_Msk;
#endif /* !CONFIG_BT_CTLR_RADIO_ENABLE_FAST */
#endif /* !CONFIG_SOC_SERIES_NRF51 && !CONFIG_SOC_COMPATIBLE_NRF54LX &&
	* !CONFIG_SOC_SERIES_NRF54H
	*/
}

void radio_tx_power_set(int8_t power)
{
	uint32_t value;

	value = hal_radio_tx_power_value(power);
	NRF_RADIO->TXPOWER = value;

#if defined(CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET)
	hal_radio_tx_power_high_voltage_set(power);
#endif /* CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET */
}

