zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/radio/radio.c
	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_RXEN);
}

void radio_tx_enable(void)
{
#if !defined(CONFIG_BT_CTLR_TIFS_HW)
#if defined(CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET) || defined(CONFIG_SOC_COMPATIBLE_NRF54LX) || \
	defined(CONFIG_SOC_SERIES_NRF54H)
	/* NOTE: Timer clear DPPI configuration is needed only for nRF53
	 *       because of calls to radio_disable() and
	 *       radio_switch_complete_and_disable() inside a radio event call
	 *       hal_radio_sw_switch_disable(), which in the case of nRF53
	 *       cancels the task subscription.
	 */
	/* FIXME: hal_sw_switch_timer_clear_ppi_config() sets both task and
	 *        event. Consider a new interface to only set the task, or
	 *        change the design to not clear task subscription inside a
	 *        radio event but when the radio event is done.
	 */
	hal_sw_switch_timer_clear_ppi_config();
#endif /* CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET || CONFIG_SOC_COMPATIBLE_NRF54LX ||
	* CONFIG_SOC_SERIES_NRF54H
	*/
#endif /* !CONFIG_BT_CTLR_TIFS_HW */

	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_TXEN);
}

void radio_disable(void)
{
#if !defined(CONFIG_BT_CTLR_TIFS_HW)
	hal_radio_sw_switch_cleanup();
#endif /* !CONFIG_BT_CTLR_TIFS_HW */

	/* Reset/disable PPI/DPPI */
	radio_tmr_status_reset();

	NRF_RADIO->SHORTS = 0;
	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
}

void radio_status_reset(void)
{
	/* NOTE: Only EVENTS_* registers read (checked) by software needs reset
	 *       between Radio IRQs. In PPI use, irrespective of stored EVENT_*
	 *       register value, PPI task will be triggered. Hence, other
	 *       EVENT_* registers are not reset to save code and CPU time.
	 */
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_READY);
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_ADDRESS);
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_END);
#if defined(CONFIG_BT_CTLR_DF_SUPPORT) && !defined(CONFIG_ZTEST)
	/* Clear it only for SoCs supporting DF extension */
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_PHYEND);
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_CTEPRESENT);
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_BCMATCH);
#endif /* CONFIG_BT_CTLR_DF_SUPPORT && !CONFIG_ZTEST */
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_DISABLED);
#if defined(CONFIG_BT_CTLR_PHY_CODED)
#if defined(CONFIG_HAS_HW_NRF_RADIO_BLE_CODED)
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_RATEBOOST);
#endif /* CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */
#endif /* CONFIG_BT_CTLR_PHY_CODED */
}

uint32_t radio_is_ready(void)
{
	return (NRF_RADIO->EVENTS_READY != 0);
}

uint32_t radio_is_address(void)
{
	return (NRF_RADIO->EVENTS_ADDRESS != 0);
}

#if defined(CONFIG_BT_CTLR_RADIO_TIMER_ISR)
static radio_tmr_isr_cb_t isr_radio_tmr_cb;
static void *isr_radio_tmr_cb_param;
#endif /* CONFIG_BT_CTLR_RADIO_TIMER_ISR */

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
static uint32_t last_pdu_end_latency_us;
static uint32_t prev_pdu_end_us;
static uint32_t last_pdu_end_us;

static void last_pdu_end_us_init(uint32_t latency_us)
{
	last_pdu_end_latency_us = latency_us;
	last_pdu_end_us = 0U;
	prev_pdu_end_us = 0U;
}

uint32_t radio_is_done(void)
{
	if (NRF_RADIO->HAL_RADIO_TRX_EVENTS_END != 0) {
		/* On packet END event increment last packet end time value.
		 * Note: this depends on the function being called exactly once
		 * in the ISR function.
		 */
		uint32_t elapsed_us;

		prev_pdu_end_us = last_pdu_end_us;
		elapsed_us = EVENT_TIMER->CC[HAL_EVENT_TIMER_TRX_END_CC_OFFSET];
		last_pdu_end_us += elapsed_us;

#if defined(CONFIG_BT_CTLR_RADIO_TIMER_ISR)
		if (isr_radio_tmr_cb != NULL) {
			uint32_t actual_us;

			actual_us = EVENT_TIMER->CC[HAL_EVENT_TIMER_DEFERRED_TRX_CC_OFFSET];
			if (actual_us > elapsed_us) {
				actual_us -= elapsed_us;
			} else {
				actual_us = 0U;
			}

			if (actual_us > HAL_RADIO_ISR_LATENCY_MAX_US) {
				nrf_timer_cc_set(EVENT_TIMER,
						 HAL_EVENT_TIMER_DEFERRED_TRX_CC_OFFSET, actual_us);
			} else {
				radio_tmr_isr_cb_t cb;

				cb = isr_radio_tmr_cb;
				isr_radio_tmr_cb = NULL;

				cb(isr_radio_tmr_cb_param, 1U);
			}
		}
#endif /* CONFIG_BT_CTLR_RADIO_TIMER_ISR */

		return 1;
	} else {
		return 0;
	}
}

#else /* !CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */
uint32_t radio_is_done(void)
{
	return (NRF_RADIO->HAL_RADIO_TRX_EVENTS_END != 0);
}
#endif /* !CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

uint32_t radio_is_tx_done(void)
{
	if (IS_ENABLED(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)) {
		return radio_is_done();
	} else {
		return 1U;
	}
}

uint32_t radio_has_disabled(void)
{
#if defined(CONFIG_BT_CTLR_TIFS_PLLEN)
	if (NRF_RADIO->EVENTS_END != 0U) {
		return 1U;
	}
#endif /* CONFIG_BT_CTLR_TIFS_PLLEN */

	return (NRF_RADIO->EVENTS_DISABLED != 0U);
}

uint32_t radio_is_idle(void)
{
	return (NRF_RADIO->STATE == 0);
}

void radio_crc_configure(uint32_t polynomial, uint32_t iv)
{
	nrf_radio_crc_configure(NRF_RADIO,
				RADIO_CRCCNF_LEN_Three,
				NRF_RADIO_CRC_ADDR_SKIP,
				polynomial);
	NRF_RADIO->CRCINIT = iv;
}

uint32_t radio_crc_is_valid(void)
{
	return (NRF_RADIO->CRCSTATUS != 0);
}

/* Note: Only 3 bytes (PDU_EM_LL_SIZE_MAX) is required for empty PDU
 *       transmission, but in case of Radio ISR latency if rx packet pointer
 *       is not setup then Radio DMA will use previously assigned buffer which
 *       can be this empty PDU buffer. Radio DMA will overrun this buffer and
 *       cause memory corruption. Any detection of ISR latency will not happen
 *       if the ISR function pointer in RAM is corrupted by this overrun.
 *       Increasing ISR latencies in OS and CPU usage in the ULL_HIGH priority
 *       if it is same as LLL priority in Controller implementation then it is
 *       making it tight to execute Controller code in the tIFS between Tx-Rx
 *       PDU's Radio ISRs.
 */
static uint8_t MALIGN(4) _pkt_empty[MAX(HAL_RADIO_PDU_LEN_MAX,
					PDU_EM_LL_SIZE_MAX)];
static uint8_t MALIGN(4) _pkt_scratch[MAX((HAL_RADIO_PDU_LEN_MAX + 3),
				       PDU_AC_LL_SIZE_MAX)];

void *radio_pkt_empty_get(void)
{
	return _pkt_empty;
}

void *radio_pkt_scratch_get(void)
{
	return _pkt_scratch;
}

