zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/radio/radio.c
void radio_tmr_tifs_set(uint32_t tifs)
{
#if defined(CONFIG_BT_CTLR_TIFS_HW)
	NRF_RADIO->TIFS = tifs;
#else /* !CONFIG_BT_CTLR_TIFS_HW */
	nrf_timer_cc_set(SW_SWITCH_TIMER,
			 SW_SWITCH_TIMER_EVTS_COMP(sw_tifs_toggle),
			 HAL_EVENT_TIMER_US_TO_TICKS(tifs));
#endif /* !CONFIG_BT_CTLR_TIFS_HW */
}

uint32_t radio_tmr_start(uint8_t trx, uint32_t ticks_start, uint32_t remainder)
{
	uint32_t remainder_us;

	/* Convert jitter to positive offset remainder in microseconds */
	hal_ticker_remove_jitter(&ticks_start, &remainder);
	remainder_us = remainder;

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	/* When using single timer for software tIFS switching, ensure that
	 * the timer compare value is large enough to consider radio ISR
	 * latency so that the ISR is able to disable the PPI/DPPI that again
	 * could trigger the TXEN/RXEN task.
	 * The timer is cleared on Radio End and if the PPI/DPPI is not disabled
	 * by the Radio ISR, the compare will trigger again.
	 */
	uint32_t latency_ticks;
	uint32_t latency_us;

	latency_us = MAX(remainder_us, HAL_RADIO_ISR_LATENCY_MAX_US) - remainder_us;
	latency_ticks = HAL_TICKER_US_TO_TICKS(latency_us);
	ticks_start -= latency_ticks;
	remainder_us += latency_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

	EVENT_TIMER->MODE = 0;
	EVENT_TIMER->PRESCALER = HAL_EVENT_TIMER_PRESCALER_VALUE;
	EVENT_TIMER->BITMODE = 2;	/* 24 - bit */

	nrf_timer_task_trigger(EVENT_TIMER, NRF_TIMER_TASK_CLEAR);
	nrf_timer_cc_set(EVENT_TIMER, HAL_EVENT_TIMER_TRX_CC_OFFSET,
			 HAL_EVENT_TIMER_US_TO_TICKS(remainder_us));

#if defined(CONFIG_BT_CTLR_RADIO_TIMER_ISR)
	if (isr_radio_tmr_cb != NULL) {
		uint32_t ticks_start_old = radio_tmr_start_get();
		uint32_t ticks_elapsed = (ticks_start - ticks_start_old) & HAL_TICKER_CNTR_MASK;

		if ((ticks_elapsed != 0U) && ((ticks_elapsed & BIT(HAL_TICKER_CNTR_MSBIT)) == 0U)) {
			uint32_t elapsed_us;
			uint32_t actual_us;

			elapsed_us = HAL_TICKER_TICKS_TO_US(ticks_elapsed);
			actual_us = EVENT_TIMER->CC[HAL_EVENT_TIMER_DEFERRED_TRX_CC_OFFSET];

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
			actual_us += last_pdu_end_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

			if (actual_us > elapsed_us) {
				actual_us -= elapsed_us;
			} else {
				actual_us = 0U;
			}

			if (actual_us > 1U) {
				nrf_timer_cc_set(EVENT_TIMER,
						 HAL_EVENT_TIMER_DEFERRED_TRX_CC_OFFSET, actual_us);
			} else {
				radio_tmr_isr_cb_t cb;

				cb = isr_radio_tmr_cb;
				isr_radio_tmr_cb = NULL;

				cb(isr_radio_tmr_cb_param, 1U);
			}
		} else {
			radio_tmr_isr_cb_t cb;

			cb = isr_radio_tmr_cb;
			isr_radio_tmr_cb = NULL;

			cb(isr_radio_tmr_cb_param, 1U);
		}
	}
#endif /* CONFIG_BT_CTLR_RADIO_TIMER_ISR */

#if defined(CONFIG_BT_CTLR_NRF_GRTC)
	uint32_t cntr_l, cntr_h, cntr_h_overflow, stale;

	/* Disable capture/compare */
	nrf_grtc_sys_counter_compare_event_disable(NRF_GRTC, HAL_CNTR_GRTC_CC_IDX_RADIO);

	/* NOTE: We are going to use TASKS_CAPTURE to read current
	 *       SYSCOUNTER H and L, so that COMPARE registers can be set
	 *       considering that we need to set H compare value too.
	 */

	/* Read current syscounter value */
	do {
		cntr_h = nrf_grtc_sys_counter_high_get(NRF_GRTC);
		cntr_l = nrf_grtc_sys_counter_low_get(NRF_GRTC);
		cntr_h_overflow = nrf_grtc_sys_counter_high_get(NRF_GRTC);
	} while ((cntr_h & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) ||
		 (cntr_h_overflow & GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Msk));

	/* Set a stale value in capture value */
	stale = cntr_l - 1U;
	NRF_GRTC->CC[HAL_CNTR_GRTC_CC_IDX_RADIO].CCL = stale;

	/* Trigger a capture */
	nrf_grtc_task_trigger(NRF_GRTC, (NRF_GRTC_TASK_CAPTURE_0 +
					 (HAL_CNTR_GRTC_CC_IDX_RADIO * sizeof(uint32_t))));

	/* Wait to get a new L value */
	do {
		cntr_l = NRF_GRTC->CC[HAL_CNTR_GRTC_CC_IDX_RADIO].CCL;
	} while (cntr_l == stale);

	/* Read H value */
	cntr_h = NRF_GRTC->CC[HAL_CNTR_GRTC_CC_IDX_RADIO].CCH;

	/* NOTE: HERE, we have cntr_h and cntr_l in sync. */

	/* Handle rollover between current and expected value */
	if (ticks_start < cntr_l) {
		cntr_h++;
	}

	/* Clear compare event, if any */
	nrf_grtc_event_clear(NRF_GRTC, HAL_CNTR_GRTC_EVENT_COMPARE_RADIO);

	/* Set compare register values */
	nrf_grtc_sys_counter_cc_set(NRF_GRTC, HAL_CNTR_GRTC_CC_IDX_RADIO,
				    ((((uint64_t)cntr_h & GRTC_CC_CCH_CCH_Msk) << 32) |
				     ticks_start));

	/* Enable compare */
	nrf_grtc_sys_counter_compare_event_enable(NRF_GRTC, HAL_CNTR_GRTC_CC_IDX_RADIO);

#else /* !CONFIG_BT_CTLR_NRF_GRTC */
	nrf_rtc_cc_set(NRF_RTC, 2, ticks_start);
	nrf_rtc_event_enable(NRF_RTC, RTC_EVTENSET_COMPARE2_Msk);
#endif  /* !CONFIG_BT_CTLR_NRF_GRTC */

	hal_event_timer_start_ppi_config();
	hal_radio_nrf_ppi_channels_enable(BIT(HAL_EVENT_TIMER_START_PPI));

	hal_radio_enable_on_tick_ppi_config_and_enable(trx);

#if !defined(CONFIG_BT_CTLR_TIFS_HW)
#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	last_pdu_end_us_init(latency_us);

#else /* !CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */
	SW_SWITCH_TIMER->MODE = 0;
	SW_SWITCH_TIMER->PRESCALER = HAL_SW_SWITCH_TIMER_PRESCALER_VALUE;
	SW_SWITCH_TIMER->BITMODE = 0; /* 16 bit */

	hal_sw_switch_timer_start_ppi_config();
#endif /* !CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

	hal_sw_switch_timer_clear_ppi_config();

#if !defined(CONFIG_BT_CTLR_PHY_CODED) || \
	!defined(CONFIG_HAS_HW_NRF_RADIO_BLE_CODED)
	/* Software switch group's disable PPI can be configured one time here
	 * at timer setup when only 1M and/or 2M is supported.
	 */
	hal_radio_group_task_disable_ppi_setup();

#else /* CONFIG_BT_CTLR_PHY_CODED && CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */
	/* Software switch group's disable PPI needs to be configured at every
	 * sw_switch() as they depend on the actual PHYs used in TX/RX mode.
	 */
#endif /* CONFIG_BT_CTLR_PHY_CODED && CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */
#endif /* !CONFIG_BT_CTLR_TIFS_HW */

	return remainder_us;
}

uint32_t radio_tmr_start_tick(uint8_t trx, uint32_t ticks_start)
{
	uint32_t remainder_us;

	/* Setup compare event with min. 1 us offset */
	remainder_us = 1U;

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	/* When using single timer for software tIFS switching, ensure that
	 * the timer compare value is large enough to consider radio ISR
	 * latency so that the ISR is able to disable the PPI/DPPI that again
	 * could trigger the TXEN/RXEN task.
	 * The timer is cleared on Radio End and if the PPI/DPPI is not disabled
	 * by the Radio ISR, the compare will trigger again.
	 */
	uint32_t latency_ticks;
	uint32_t latency_us;

