zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/radio/radio.c
	latency_us = MAX(remainder_us, HAL_RADIO_ISR_LATENCY_MAX_US) - remainder_us;
	latency_ticks = HAL_TICKER_US_TO_TICKS(latency_us);
	ticks_start -= latency_ticks;
	remainder_us += latency_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

	nrf_timer_task_trigger(EVENT_TIMER, NRF_TIMER_TASK_STOP);

	EVENT_TIMER->MODE = 0;
	EVENT_TIMER->PRESCALER = HAL_EVENT_TIMER_PRESCALER_VALUE;
	EVENT_TIMER->BITMODE = 2;	/* 24 - bit */

	nrf_timer_task_trigger(EVENT_TIMER, NRF_TIMER_TASK_CLEAR);
	nrf_timer_cc_set(EVENT_TIMER, HAL_EVENT_TIMER_TRX_CC_OFFSET,
			 HAL_EVENT_TIMER_US_TO_TICKS(remainder_us));

#if defined(CONFIG_BT_CTLR_RADIO_TIMER_ISR)
	if (isr_radio_tmr_cb != NULL) {
		uint32_t ticks_start_old = radio_tmr_start_get();
		uint32_t ticks_elapsed = (ticks_start - ticks_start_old) & HAL_TICKER_CNTR_MASK;

		if ((ticks_elapsed != 0U) && ((ticks_elapsed & BIT(HAL_TICKER_CNTR_MSBIT)) == 0U)) {
			uint32_t elapsed_us;
			uint32_t actual_us;

			elapsed_us = HAL_TICKER_TICKS_TO_US(ticks_elapsed);
			actual_us = EVENT_TIMER->CC[HAL_EVENT_TIMER_DEFERRED_TRX_CC_OFFSET];

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
			actual_us += last_pdu_end_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

			if (actual_us > elapsed_us) {
				actual_us -= elapsed_us;
			} else {
				actual_us = 0U;
			}

			if (actual_us > 1U) {
				nrf_timer_cc_set(EVENT_TIMER,
						 HAL_EVENT_TIMER_DEFERRED_TRX_CC_OFFSET, actual_us);
			} else {
				radio_tmr_isr_cb_t cb;

				cb = isr_radio_tmr_cb;
				isr_radio_tmr_cb = NULL;

				cb(isr_radio_tmr_cb_param, 1U);
			}
		} else {
			radio_tmr_isr_cb_t cb;

			cb = isr_radio_tmr_cb;
			isr_radio_tmr_cb = NULL;

			cb(isr_radio_tmr_cb_param, 1U);
		}
	}
#endif /* CONFIG_BT_CTLR_RADIO_TIMER_ISR */

#if defined(CONFIG_BT_CTLR_NRF_GRTC)
	uint32_t cntr_l, cntr_h, cntr_h_overflow, stale;

	/* Disable capture/compare */
	nrf_grtc_sys_counter_compare_event_disable(NRF_GRTC, HAL_CNTR_GRTC_CC_IDX_RADIO);

	/* NOTE: We are going to use TASKS_CAPTURE to read current
	 *       SYSCOUNTER H and L, so that COMPARE registers can be set
	 *       considering that we need to set H compare value too.
	 */

	/* Read current syscounter value */
	do {
		cntr_h = nrf_grtc_sys_counter_high_get(NRF_GRTC);
		cntr_l = nrf_grtc_sys_counter_low_get(NRF_GRTC);
		cntr_h_overflow = nrf_grtc_sys_counter_high_get(NRF_GRTC);
	} while ((cntr_h & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) ||
		 (cntr_h_overflow & GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Msk));

	/* Set a stale value in capture value */
	stale = cntr_l - 1U;
	NRF_GRTC->CC[HAL_CNTR_GRTC_CC_IDX_RADIO].CCL = stale;

	/* Trigger a capture */
	nrf_grtc_task_trigger(NRF_GRTC, (NRF_GRTC_TASK_CAPTURE_0 +
					 (HAL_CNTR_GRTC_CC_IDX_RADIO * sizeof(uint32_t))));

	/* Wait to get a new L value */
	do {
		cntr_l = NRF_GRTC->CC[HAL_CNTR_GRTC_CC_IDX_RADIO].CCL;
	} while (cntr_l == stale);

	/* Read H value */
	cntr_h = NRF_GRTC->CC[HAL_CNTR_GRTC_CC_IDX_RADIO].CCH;

	/* NOTE: HERE, we have cntr_h and cntr_l in sync. */

	/* Handle rollover between current and expected value */
	if (ticks_start < cntr_l) {
		cntr_h++;
	}

	/* Clear compare event, if any */
	nrf_grtc_event_clear(NRF_GRTC, HAL_CNTR_GRTC_EVENT_COMPARE_RADIO);

	/* Set compare register values */
	nrf_grtc_sys_counter_cc_set(NRF_GRTC, HAL_CNTR_GRTC_CC_IDX_RADIO,
				    ((((uint64_t)cntr_h & GRTC_CC_CCH_CCH_Msk) << 32) |
				     ticks_start));

	/* Enable compare */
	nrf_grtc_sys_counter_compare_event_enable(NRF_GRTC, HAL_CNTR_GRTC_CC_IDX_RADIO);

#else /* !CONFIG_BT_CTLR_NRF_GRTC */
	nrf_rtc_cc_set(NRF_RTC, 2, ticks_start);
	nrf_rtc_event_enable(NRF_RTC, RTC_EVTENSET_COMPARE2_Msk);
#endif  /* !CONFIG_BT_CTLR_NRF_GRTC */

	hal_event_timer_start_ppi_config();
	hal_radio_nrf_ppi_channels_enable(BIT(HAL_EVENT_TIMER_START_PPI));

	hal_radio_enable_on_tick_ppi_config_and_enable(trx);

#if !defined(CONFIG_BT_CTLR_TIFS_HW)
#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	last_pdu_end_us_init(latency_us);
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */
#if defined(CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET) || defined(CONFIG_SOC_COMPATIBLE_NRF54LX) || \
	defined(CONFIG_SOC_SERIES_NRF54H)
	/* NOTE: Timer clear DPPI configuration is needed only for nRF53
	 *       because of calls to radio_disable() and
	 *       radio_switch_complete_and_disable() inside a radio event call
	 *       hal_radio_sw_switch_disable(), which in the case of nRF53
	 *       cancels the task subscription.
	 */
	/* FIXME: hal_sw_switch_timer_clear_ppi_config() sets both task and
	 *        event. Consider a new interface to only set the task, or
	 *        change the design to not clear task subscription inside a
	 *        radio event but when the radio event is done.
	 */
	hal_sw_switch_timer_clear_ppi_config();
#endif /* CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET || CONFIG_SOC_COMPATIBLE_NRF54LX ||
	* CONFIG_SOC_SERIES_NRF54H
	*/
#endif /* !CONFIG_BT_CTLR_TIFS_HW */

	return remainder_us;
}

uint32_t radio_tmr_start_us(uint8_t trx, uint32_t start_us)
{
	hal_radio_enable_on_tick_ppi_config_and_enable(trx);

#if !defined(CONFIG_BT_CTLR_TIFS_HW)
#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	/* As timer is reset on every radio end, remove the accumulated
	 * last_pdu_end_us in the given start_us.
	 */
	start_us -= last_pdu_end_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */
#if defined(CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET) || defined(CONFIG_SOC_COMPATIBLE_NRF54LX) || \
	defined(CONFIG_SOC_SERIES_NRF54H)
	/* NOTE: Timer clear DPPI configuration is needed only for nRF53
	 *       because of calls to radio_disable() and
	 *       radio_switch_complete_and_disable() inside a radio event call
	 *       hal_radio_sw_switch_disable(), which in the case of nRF53
	 *       cancels the task subscription.
	 */
	/* FIXME: hal_sw_switch_timer_clear_ppi_config() sets both task and
	 *        event. Consider a new interface to only set the task, or
	 *        change the design to not clear task subscription inside a
	 *        radio event but when the radio event is done.
	 */
	hal_sw_switch_timer_clear_ppi_config();
#endif /* CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET || CONFIG_SOC_COMPATIBLE_NRF54LX ||
	* CONFIG_SOC_SERIES_NRF54H
	*/
#endif /* !CONFIG_BT_CTLR_TIFS_HW */

	/* start_us could be the current count in the timer */
	uint32_t now_us = start_us;
	uint32_t actual_us;

	uint32_t cc = EVENT_TIMER->CC[HAL_EVENT_TIMER_SAMPLE_CC_OFFSET];

