zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/radio/radio.c
	/* Setup timer compare while determining the latency in doing so */
	do {
		/* Set start to be, now plus the determined latency */
		start_us = (now_us << 1) - start_us;

		/* Setup compare event with min. 1 us offset */
		actual_us = start_us + 1U;

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
		/* When using single timer for software tIFS switching, ensure that
		 * the timer compare value is large enough to consider radio ISR
		 * latency so that the ISR is able to disable the PPI/DPPI that again
		 * could trigger the TXEN/RXEN task.
		 * The timer is cleared on Radio End and if the PPI/DPPI is not disabled
		 * by the Radio ISR, the compare will trigger again.
		 */
		uint32_t latency_us;

		latency_us = MAX(actual_us, HAL_RADIO_ISR_LATENCY_MAX_US) - actual_us;
		actual_us += latency_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

		nrf_timer_event_clear(EVENT_TIMER, HAL_EVENT_TIMER_TRX_EVENT);
		nrf_timer_cc_set(EVENT_TIMER, HAL_EVENT_TIMER_TRX_CC_OFFSET,
				 HAL_EVENT_TIMER_US_TO_TICKS(actual_us));

		/* Capture the current time */
		nrf_timer_task_trigger(EVENT_TIMER, HAL_EVENT_TIMER_SAMPLE_TASK);

		now_us = EVENT_TIMER->CC[HAL_EVENT_TIMER_SAMPLE_CC_OFFSET];
	} while ((now_us > start_us) &&
		 (EVENT_TIMER->EVENTS_COMPARE[HAL_EVENT_TIMER_TRX_CC_OFFSET] == 0U));

	nrf_timer_cc_set(EVENT_TIMER, HAL_EVENT_TIMER_SAMPLE_CC_OFFSET, cc);

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	actual_us += last_pdu_end_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

	return actual_us;
}

uint32_t radio_tmr_start_now(uint8_t trx)
{
	uint32_t start_us;

	/* PPI/DPPI configuration will be done in radio_tmr_start_us() */

	uint32_t cc = EVENT_TIMER->CC[HAL_EVENT_TIMER_SAMPLE_CC_OFFSET];

	/* Capture the current time */
	nrf_timer_task_trigger(EVENT_TIMER, HAL_EVENT_TIMER_SAMPLE_TASK);
	start_us = EVENT_TIMER->CC[HAL_EVENT_TIMER_SAMPLE_CC_OFFSET];

	nrf_timer_cc_set(EVENT_TIMER, HAL_EVENT_TIMER_SAMPLE_CC_OFFSET, cc);

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	/* As timer is reset on every radio end, add the accumulated
	 * last_pdu_end_us to the captured current time.
	 */
	start_us += last_pdu_end_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

	/* Setup radio start at current time */
	start_us = radio_tmr_start_us(trx, start_us);

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	/* Remove the single timer start latency used to mitigate use of too
	 * small compare register value. Thus, start_us returned be always
	 * the value corresponding to the captured radio ready timestamp.
	 * This is used in the calculation of aux_offset in subsequent
	 * ADV_EXT_IND PDUs.
	 */
	start_us -= last_pdu_end_latency_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

	return start_us;
}

static uint32_t ticks_radio_tmr_start;

void radio_tmr_start_save(uint32_t ticks_start)
{
	ticks_radio_tmr_start = ticks_start;
}

uint32_t radio_tmr_start_restore(void)
{
	return ticks_radio_tmr_start;
}

uint32_t radio_tmr_start_get(void)
{
	uint32_t ticks_start;

#if defined(CONFIG_BT_CTLR_NRF_GRTC)
	uint64_t cc;

	cc = nrf_grtc_sys_counter_cc_get(NRF_GRTC, HAL_CNTR_GRTC_CC_IDX_RADIO);

	ticks_start = cc & 0xffffffffUL;

#else /* !CONFIG_BT_CTLR_NRF_GRTC */
	ticks_start = nrf_rtc_cc_get(NRF_RTC, 2);
#endif  /* !CONFIG_BT_CTLR_NRF_GRTC */

	return ticks_start;
}

uint32_t radio_tmr_start_latency_get(void)
{
#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	return last_pdu_end_latency_us;
#else /* !CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */
	return 0U;
#endif /* !CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */
}

void radio_tmr_stop(void)
{
	nrf_timer_task_trigger(EVENT_TIMER, NRF_TIMER_TASK_STOP);
#if defined(TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk)
	nrf_timer_task_trigger(EVENT_TIMER, NRF_TIMER_TASK_SHUTDOWN);
#endif /* TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk */

#if !defined(CONFIG_BT_CTLR_TIFS_HW)
#if !defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	nrf_timer_task_trigger(SW_SWITCH_TIMER, NRF_TIMER_TASK_STOP);
#if defined(TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk)
	nrf_timer_task_trigger(SW_SWITCH_TIMER, NRF_TIMER_TASK_SHUTDOWN);
#endif /* TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk */
#endif /* !CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */
#endif /* !CONFIG_BT_CTLR_TIFS_HW */

/* TODO: Check if this is needed for other SoCs like nRF54H20 */
#if defined(CONFIG_SOC_COMPATIBLE_NRF54LX)
#if defined(CONFIG_NRF_SYS_EVENT)
	(void)nrf_sys_event_release_global_constlat();

#else /* !CONFIG_NRF_SYS_EVENT */
	/* Refer to nRF54L Product Specifications for below quirks.
	 * FIXME: Use on off service design to share these request with application implementations.
	 */
	/* Put back RRAMC in auto power down mode */
	NRF_RRAMC->POWER.LOWPOWERCONFIG = (RRAMC_POWER_LOWPOWERCONFIG_MODE_PowerOff <<
					   RRAMC_POWER_LOWPOWERCONFIG_MODE_Pos) &
					  RRAMC_POWER_LOWPOWERCONFIG_MODE_Msk;

	/* Enable Low-power mode (variable latency) */
	NRF_POWER->TASKS_LOWPWR = 1U;
#endif /* !CONFIG_NRF_SYS_EVENT */
#endif /* CONFIG_SOC_COMPATIBLE_NRF54LX */
}

void radio_tmr_hcto_configure(uint32_t hcto_us)
{
	nrf_timer_cc_set(EVENT_TIMER, HAL_EVENT_TIMER_HCTO_CC_OFFSET,
			 HAL_EVENT_TIMER_US_TO_TICKS(hcto_us));

	hal_radio_recv_timeout_cancel_ppi_config();
	hal_radio_disable_on_hcto_ppi_config();
	hal_radio_nrf_ppi_channels_enable(
		BIT(HAL_RADIO_RECV_TIMEOUT_CANCEL_PPI) |
		BIT(HAL_RADIO_DISABLE_ON_HCTO_PPI));
}

void radio_tmr_hcto_configure_abs(uint32_t hcto_from_start_us)
{
#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	/* As timer is reset on every radio end, remove the accumulated
	 * last_pdu_end_us in the given hcto_us.
	 */
	hcto_from_start_us -= last_pdu_end_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

	radio_tmr_hcto_configure(hcto_from_start_us);
}

void radio_tmr_aa_capture(void)
{
	hal_radio_ready_time_capture_ppi_config();
	hal_radio_recv_timeout_cancel_ppi_config();
	hal_radio_nrf_ppi_channels_enable(
		BIT(HAL_RADIO_READY_TIME_CAPTURE_PPI) |
		BIT(HAL_RADIO_RECV_TIMEOUT_CANCEL_PPI));
}

uint32_t radio_tmr_aa_get(void)
{
	uint32_t aa_us;

	aa_us = EVENT_TIMER->CC[HAL_EVENT_TIMER_HCTO_CC_OFFSET];

#if defined(CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER)
	aa_us += prev_pdu_end_us;
#endif /* CONFIG_BT_CTLR_SW_SWITCH_SINGLE_TIMER */

	return aa_us;
}

static uint32_t radio_tmr_aa;

