zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/radio/radio.c
static struct {
	uint16_t in_alen;
	uint16_t in_mlen;
	uint8_t  in_mlen_msb;
	uint8_t  out_mlen_msb;
	uint16_t out_alen;
	struct ccm_job_ptr in[6];
	struct ccm_job_ptr out[6];
} ccm_job;

#else /* EASYVDMA_PRESENT */
static uint8_t MALIGN(4) _ccm_scratch[(HAL_RADIO_PDU_LEN_MAX - 4) + 16];
#endif /* EASYVDMA_PRESENT */

#if defined(CONFIG_BT_CTLR_LE_ENC) || defined(CONFIG_BT_CTLR_SYNC_ISO)
static void *radio_ccm_ext_rx_pkt_set(struct ccm *cnf, uint8_t phy, uint8_t pdu_type, void *pkt)
{
	uint32_t mode;

	NRF_CCM->ENABLE = CCM_ENABLE_ENABLE_Disabled;
	NRF_CCM->ENABLE = CCM_ENABLE_ENABLE_Enabled;

	/* Select the CCM decryption mode for the SoC */
#if defined(CONFIG_SOC_COMPATIBLE_NRF54LX) || defined(CONFIG_SOC_SERIES_NRF54H)
	/* NOTE: Use fast decryption as rx data is decrypt after payload is received, compared to
	 *       decrypting in parallel with radio reception of address in nRF51/nRF52/nRF53.
	 */
	mode = (CCM_MODE_MODE_FastDecryption << CCM_MODE_MODE_Pos) &
	       CCM_MODE_MODE_Msk;

	/* Enable CCM Protocol Mode Bluetooth LE */
	mode |= (CCM_MODE_PROTOCOL_Ble << CCM_MODE_PROTOCOL_Pos) &
		CCM_MODE_PROTOCOL_Msk;

	/* Enable CCM MAC Length 4 bytes */
	mode |= (CCM_MODE_MACLEN_M4 << CCM_MODE_MACLEN_Pos) &
		CCM_MODE_MACLEN_Msk;

#elif defined(CONFIG_SOC_COMPATIBLE_NRF52X) || defined(CONFIG_SOC_COMPATIBLE_NRF5340_CPUNET)
	mode = (CCM_MODE_MODE_Decryption << CCM_MODE_MODE_Pos) &
	       CCM_MODE_MODE_Msk;

	/* Enable CCM support for 8-bit length field PDUs. */
	mode |= (CCM_MODE_LENGTH_Extended << CCM_MODE_LENGTH_Pos) &
		CCM_MODE_LENGTH_Msk;

#elif defined(CONFIG_SOC_SERIES_NRF51)
	mode = (CCM_MODE_MODE_Decryption << CCM_MODE_MODE_Pos) &
	       CCM_MODE_MODE_Msk;

#else
#error "H/w accelerated decryption unsupported."
#endif

	/* Select CCM data rate based on current PHY in use. */
	switch (phy) {
	default:
	case PHY_1M:
#if !defined(CONFIG_SOC_SERIES_NRF51) && !defined(CONFIG_SOC_COMPATIBLE_NRF54LX)
		mode |= (CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos) &
			CCM_MODE_DATARATE_Msk;
#endif /* !CONFIG_SOC_SERIES_NRF51 && !CONFIG_SOC_COMPATIBLE_NRF54LX */

		if (false) {

#if defined(CONFIG_BT_CTLR_DF_CONN_CTE_RX)
		} else if (pdu_type == RADIO_PKT_CONF_PDU_TYPE_DC) {
			/* When direction finding CTE receive feature is enabled then on-the-fly
			 * PDU parsing for CTEInfo is always done. In such situation, the CCM
			 * TASKS_CRYPT must be started with short delay. That give the Radio time
			 * to store received bits in shared memory.
			 */
			radio_bc_configure(CCM_TASKS_CRYPT_DELAY_BITS);
			radio_bc_status_reset();
			hal_trigger_crypt_by_bcmatch_ppi_config();
			hal_radio_nrf_ppi_channels_enable(BIT(HAL_TRIGGER_CRYPT_DELAY_PPI));
#endif /* CONFIG_BT_CTLR_DF_CONN_CTE_RX */
		} else {
			hal_trigger_crypt_ppi_config();
			hal_radio_nrf_ppi_channels_enable(BIT(HAL_TRIGGER_CRYPT_PPI));
		}
		break;

	case PHY_2M:
#if !defined(CONFIG_SOC_SERIES_NRF51) && !defined(CONFIG_SOC_COMPATIBLE_NRF54LX)
		mode |= (CCM_MODE_DATARATE_2Mbit << CCM_MODE_DATARATE_Pos) &
			CCM_MODE_DATARATE_Msk;
#endif /* !CONFIG_SOC_SERIES_NRF51 && !CONFIG_SOC_COMPATIBLE_NRF54LX */

		hal_trigger_crypt_ppi_config();
		hal_radio_nrf_ppi_channels_enable(BIT(HAL_TRIGGER_CRYPT_PPI));

		break;

#if defined(CONFIG_BT_CTLR_PHY_CODED)
#if defined(CONFIG_HAS_HW_NRF_RADIO_BLE_CODED)
	case PHY_CODED:
#if !defined(CONFIG_SOC_COMPATIBLE_NRF54LX)
		mode |= (CCM_MODE_DATARATE_125Kbps << CCM_MODE_DATARATE_Pos) &
			CCM_MODE_DATARATE_Msk;
#endif /* !CONFIG_SOC_COMPATIBLE_NRF54LX */

		NRF_CCM->RATEOVERRIDE =
			(CCM_RATEOVERRIDE_RATEOVERRIDE_500Kbps <<
			 CCM_RATEOVERRIDE_RATEOVERRIDE_Pos) &
			CCM_RATEOVERRIDE_RATEOVERRIDE_Msk;

		hal_trigger_rateoverride_ppi_config();
		hal_radio_nrf_ppi_channels_enable(
			BIT(HAL_TRIGGER_RATEOVERRIDE_PPI));

		hal_trigger_crypt_ppi_config();
		hal_radio_nrf_ppi_channels_enable(BIT(HAL_TRIGGER_CRYPT_PPI));

		break;
#endif /* CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */
#endif /* CONFIG_BT_CTLR_PHY_CODED */
	}

	NRF_CCM->MODE = mode;

#if defined(CONFIG_HAS_HW_NRF_CCM_HEADERMASK) || \
	defined(CONFIG_SOC_COMPATIBLE_NRF54LX) || \
	defined(CONFIG_SOC_SERIES_NRF54H)
#if defined(CONFIG_HAS_HW_NRF_CCM_HEADERMASK)
#define ADATAMASK HEADERMASK
#endif /* CONFIG_HAS_HW_NRF_CCM_HEADERMASK */
	switch (pdu_type) {
	case RADIO_PKT_CONF_PDU_TYPE_BIS:
		NRF_CCM->ADATAMASK = 0xC3; /* mask CSSN and CSTF */
		break;
	case RADIO_PKT_CONF_PDU_TYPE_CIS:
		NRF_CCM->ADATAMASK = 0xA3; /* mask SN, NESN, CIE and NPI */
		break;
	default:
		/* Using default reset value of ADATAMASK */
		NRF_CCM->ADATAMASK = 0xE3; /* mask SN, NESN and MD */
		break;
	}
#if defined(CONFIG_HAS_HW_NRF_CCM_HEADERMASK)
#undef ADATAMASK
#endif /* CONFIG_HAS_HW_NRF_CCM_HEADERMASK */
#endif /* CONFIG_HAS_HW_NRF_CCM_HEADERMASK ||
	* CONFIG_SOC_COMPATIBLE_NRF54LX ||
	* CONFIG_SOC_SERIES_NRF54H
	*/

#if !defined(CONFIG_SOC_SERIES_NRF51) && \
	!defined(CONFIG_SOC_NRF52832) && \
	!defined(CONFIG_SOC_COMPATIBLE_NRF54LX) && \
	!defined(CONFIG_SOC_SERIES_NRF54H) && \
	(!defined(CONFIG_BT_CTLR_DATA_LENGTH_MAX) || \
	 (CONFIG_BT_CTLR_DATA_LENGTH_MAX < ((HAL_RADIO_PDU_LEN_MAX) - 4U)))
	const uint8_t max_len = (NRF_RADIO->PCNF1 & RADIO_PCNF1_MAXLEN_Msk) >>
				RADIO_PCNF1_MAXLEN_Pos;

	/* MAXPACKETSIZE value 0x001B (27) - 0x00FB (251) bytes */
	NRF_CCM->MAXPACKETSIZE = CLAMP((max_len - PDU_MIC_SIZE), 0x001B, 0x00FB);
#endif

#if defined(EASYVDMA_PRESENT)
	/* Configure the CCM key, nonce and pointers */
	NRF_CCM->KEY.VALUE[3] = sys_get_be32(&cnf->key[0]);
	NRF_CCM->KEY.VALUE[2] = sys_get_be32(&cnf->key[4]);
	NRF_CCM->KEY.VALUE[1] = sys_get_be32(&cnf->key[8]);
	NRF_CCM->KEY.VALUE[0] = sys_get_be32(&cnf->key[12]);

	NRF_CCM->NONCE.VALUE[3] = ((uint8_t *)&cnf->counter)[0];
	NRF_CCM->NONCE.VALUE[2] = sys_get_be32(&((uint8_t *)&cnf->counter)[1]) |
				  (cnf->direction << 7);
	NRF_CCM->NONCE.VALUE[1] = sys_get_be32(&cnf->iv[0]);
	NRF_CCM->NONCE.VALUE[0] = sys_get_be32(&cnf->iv[4]);

	const uint8_t mlen = (NRF_RADIO->PCNF1 & RADIO_PCNF1_MAXLEN_Msk) >>
			     RADIO_PCNF1_MAXLEN_Pos;

	const uint8_t alen = sizeof(uint8_t);

	ccm_job.in_alen = alen;
	ccm_job.in[0].ptr = &ccm_job.in_alen;
	ccm_job.in[0].length = sizeof(ccm_job.in_alen);
	ccm_job.in[0].attribute = CCM_JOB_PTR_ATTRIBUTE_ALEN;

