zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/radio/radio.c
	const uint8_t mlen = *((uint8_t *)pkt + 1U);

	ccm_job.in_mlen = mlen;
	ccm_job.in[1].ptr = &ccm_job.in_mlen;
	ccm_job.in[1].length = sizeof(ccm_job.in_mlen);
	ccm_job.in[1].attribute = CCM_JOB_PTR_ATTRIBUTE_MLEN;

	ccm_job.in[2].ptr = (void *)((uint8_t *)pkt + 0U);
	ccm_job.in[2].length = alen;
	ccm_job.in[2].attribute = CCM_JOB_PTR_ATTRIBUTE_ADATA;

	ccm_job.in[3].ptr = (void *)((uint8_t *)pkt + 3U);
	ccm_job.in[3].length = mlen;
	ccm_job.in[3].attribute = CCM_JOB_PTR_ATTRIBUTE_MDATA;

	ccm_job.in[4].ptr = NULL;
	ccm_job.in[4].length = 0U;
	ccm_job.in[4].attribute = 0U;

	ccm_job.out[0].ptr = &ccm_job.out_alen;
	ccm_job.out[0].length = sizeof(ccm_job.out_alen);
	ccm_job.out[0].attribute = CCM_JOB_PTR_ATTRIBUTE_ALEN;

	ccm_job.out[1].ptr = (void *)((uint8_t *)_pkt_scratch + 1U);
	ccm_job.out[1].length = sizeof(uint8_t);
	ccm_job.out[1].attribute = CCM_JOB_PTR_ATTRIBUTE_MLEN;

	ccm_job.out[2].ptr = &ccm_job.out_mlen_msb;
	ccm_job.out[2].length = sizeof(ccm_job.out_mlen_msb);
	ccm_job.out[2].attribute = CCM_JOB_PTR_ATTRIBUTE_MLEN;

	ccm_job.out[3].ptr = (void *)((uint8_t *)_pkt_scratch + 0U);
	ccm_job.out[3].length = sizeof(uint8_t);
	ccm_job.out[3].attribute = CCM_JOB_PTR_ATTRIBUTE_ADATA;

	ccm_job.out[4].ptr = (void *)((uint8_t *)_pkt_scratch + 3U);
	ccm_job.out[4].length = mlen + sizeof(uint32_t);
	ccm_job.out[4].attribute = CCM_JOB_PTR_ATTRIBUTE_MDATA;

	ccm_job.out[5].ptr = NULL;
	ccm_job.out[5].length = 0U;
	ccm_job.out[5].attribute = 0U;

	NRF_CCM->IN.PTR = (uint32_t)ccm_job.in;
	NRF_CCM->OUT.PTR = (uint32_t)ccm_job.out;

	nrf_ccm_event_clear(NRF_CCM, NRF_CCM_EVENT_END);
	nrf_ccm_event_clear(NRF_CCM, NRF_CCM_EVENT_ERROR);

	nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_START);

#else /* EASYVDMA_PRESENT */
	NRF_CCM->CNFPTR = (uint32_t)cnf;
	NRF_CCM->INPTR = (uint32_t)pkt;
	NRF_CCM->OUTPTR = (uint32_t)_pkt_scratch;
	NRF_CCM->SCRATCHPTR = (uint32_t)_ccm_scratch;
	NRF_CCM->SHORTS = CCM_SHORTS_ENDKSGEN_CRYPT_Msk;

	nrf_ccm_event_clear(NRF_CCM, NRF_CCM_EVENT_ENDKSGEN);
	nrf_ccm_event_clear(NRF_CCM, NRF_CCM_EVENT_END);
	nrf_ccm_event_clear(NRF_CCM, NRF_CCM_EVENT_ERROR);

	nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_KSGEN);
#endif /* EASYVDMA_PRESENT */

	return _pkt_scratch;
}

void *radio_ccm_tx_pkt_set(struct ccm *cnf, void *pkt)
{
	return radio_ccm_ext_tx_pkt_set(cnf, RADIO_PKT_CONF_PDU_TYPE_DC, pkt);
}

void *radio_ccm_iso_tx_pkt_set(struct ccm *cnf, uint8_t pdu_type, void *pkt)
{
	return radio_ccm_ext_tx_pkt_set(cnf, pdu_type, pkt);
}
#endif /* CONFIG_BT_CTLR_LE_ENC || CONFIG_BT_CTLR_ADV_ISO */

uint32_t radio_ccm_is_done(void)
{
	nrf_ccm_int_enable(NRF_CCM, CCM_INTENSET_ENDCRYPT_Msk);
	while (NRF_CCM->EVENTS_ENDCRYPT == 0) {
		cpu_sleep();
	}
	nrf_ccm_int_disable(NRF_CCM, CCM_INTENCLR_ENDCRYPT_Msk);
	NVIC_ClearPendingIRQ(nrfx_get_irq_number(NRF_CCM));

	return (NRF_CCM->EVENTS_ERROR == 0);
}

uint32_t radio_ccm_mic_is_valid(void)
{
	return (NRF_CCM->MICSTATUS != 0);
}

void radio_ccm_disable(void)
{
	nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_STOP);
	nrf_ccm_disable(NRF_CCM);
}
#endif /* CONFIG_BT_CTLR_LE_ENC || CONFIG_BT_CTLR_BROADCAST_ISO_ENC */

#if defined(CONFIG_BT_CTLR_PRIVACY)
#if defined(EASYVDMA_PRESENT)
struct aar_job_ptr {
	void *ptr;
	struct {
		uint32_t length:24;
		uint32_t attribute:8;
	} __packed;
} __packed;

#define AAR_JOB_PTR_ATTRIBUTE_HASH  11U
#define AAR_JOB_PTR_ATTRIBUTE_PRAND 12U
#define AAR_JOB_PTR_ATTRIBUTE_IRK   13U
#define AAR_JOB_PTR_ATTRIBUTE_INDEX 11U

#define AAR_JOB_OUT_MAX_RESOLVED 1U

#define AAR_IRK_SIZE 16U

#define RADIO_PACKET_PTR_TO_PDU_OFFSET 3U

#define BDADDR_HASH_OFFSET 0U
#define BDADDR_HASH_SIZE   3U
#define BDADDR_PRND_OFFSET 3U
#define BDADDR_PRND_SIZE   3U

/* AAR HAL global memory referenced by the h/w peripheral and its DMA */
static struct {
	/* Index of the IRK match in the AAR job list, on successful resolution */
	uint32_t status;

	/* Input AAR job list; list of Hash, Prand, IRKs and a terminating empty job entry */
	struct aar_job_ptr in[CONFIG_BT_CTLR_RL_SIZE + 3];

	/* Output AAR job list of one entry */
	struct aar_job_ptr out[AAR_JOB_OUT_MAX_RESOLVED];

	/* NOTE: Refer to the AAR section in the SoC product specification for details */
} aar_job;

#else /* EASYVDMA_PRESENT */
static uint8_t MALIGN(4) _aar_scratch[3];
#endif /* EASYVDMA_PRESENT */

void radio_ar_configure(uint32_t nirk, void *irk, uint8_t flags)
{
	uint32_t addrptr;
	uint8_t bcc;
	uint8_t phy;

	/* Flags provide hint on how to setup AAR:
	 * ....Xb - legacy PDU
	 * ...X.b - extended PDU
	 * XXX..b = RX PHY
	 * 00000b = default case mapped to 00101b (legacy, 1M)
	 *
	 * If neither legacy not extended bit is set, legacy PDU is selected for
	 * 1M PHY and extended PDU otherwise.
	 */

	phy = flags >> 2;

	/* Check if extended PDU or non-1M and not legacy PDU */
	if (IS_ENABLED(CONFIG_BT_CTLR_ADV_EXT) &&
	    ((flags & BIT(1)) || (!(flags & BIT(0)) && (phy > PHY_1M)))) {
		addrptr = NRF_RADIO->PACKETPTR + 1;
		bcc = 80;
	} else {
		addrptr = NRF_RADIO->PACKETPTR - 1;
		bcc = 64;
	}

	/* For Coded PHY adjust for CI and TERM1 */
	if (IS_ENABLED(CONFIG_BT_CTLR_PHY_CODED) && (phy == PHY_CODED)) {
		bcc += 5;
	}

	NRF_AAR->ENABLE = (AAR_ENABLE_ENABLE_Enabled << AAR_ENABLE_ENABLE_Pos) &
			  AAR_ENABLE_ENABLE_Msk;

#if defined(EASYVDMA_PRESENT)
	/* Input, Resolvable Address Hash offset in the legacy or extended advertising PDU.
	 * Radio packet pointer offset by 3 compared to legacy AAR in nRF51/52/53 SoCs that took
	 * Radio packet pointer value.
	 */
	aar_job.in[0].ptr = (uint8_t *)addrptr + RADIO_PACKET_PTR_TO_PDU_OFFSET +
			    BDADDR_HASH_OFFSET;
	aar_job.in[0].length = BDADDR_HASH_SIZE;
	aar_job.in[0].attribute = AAR_JOB_PTR_ATTRIBUTE_HASH;

	/* Input, Resolvable Address Random offset in the legacy or extended advertising PDU.
	 * Radio packet pointer offset by 3 compared to legacy AAR in nRF51/52/53 SoCs that took
	 * Radio packet pointer, plus offset of the 24-bit random in the legacy or extended
	 * advertising PDU after the 24-bit Hash in the Resolvable Address.
	 */
	aar_job.in[1].ptr = (uint8_t *)addrptr + RADIO_PACKET_PTR_TO_PDU_OFFSET +
			    BDADDR_PRND_OFFSET;
	aar_job.in[1].length = BDADDR_PRND_SIZE;
	aar_job.in[1].attribute = AAR_JOB_PTR_ATTRIBUTE_PRAND;

	/* Input, list of IRKs used for resolution */
	for (uint32_t i = 0; i < nirk; i++) {
		aar_job.in[2U + i].ptr = (void *)(((uint8_t *)irk) + (AAR_IRK_SIZE * i));
		aar_job.in[2U + i].length = AAR_IRK_SIZE;
		aar_job.in[2U + i].attribute = AAR_JOB_PTR_ATTRIBUTE_IRK;
	}

	/* A terminating empty job entry */
	aar_job.in[2U + nirk].ptr = 0U;
	aar_job.in[2U + nirk].length = 0U;
	aar_job.in[2U + nirk].attribute = 0U;

	/* Reset match index to invalid value ( >= CONFIG_BT_CTLR_RL_SIZE ) */
	aar_job.status = UINT32_MAX;

	/* Output, single job entry that populates the `status` value with match index */
	aar_job.out[0].ptr = &aar_job.status;
	aar_job.out[0].length = sizeof(aar_job.status);
	aar_job.out[0].attribute = AAR_JOB_PTR_ATTRIBUTE_INDEX;

	NRF_AAR->IN.PTR = (uint32_t)&aar_job.in[0];
	NRF_AAR->OUT.PTR = (uint32_t)&aar_job.out[0];
	NRF_AAR->MAXRESOLVED = AAR_JOB_OUT_MAX_RESOLVED;

#else /* EASYVDMA_PRESENT */
	NRF_AAR->NIRK = nirk;
	NRF_AAR->IRKPTR = (uint32_t)irk;
	NRF_AAR->ADDRPTR = addrptr;
	NRF_AAR->SCRATCHPTR = (uint32_t)&_aar_scratch[0];
#endif /* EASYVDMA_PRESENT */

	nrf_aar_event_clear(NRF_AAR, NRF_AAR_EVENT_END);
	nrf_aar_event_clear(NRF_AAR, NRF_AAR_EVENT_RESOLVED);
	nrf_aar_event_clear(NRF_AAR, NRF_AAR_EVENT_NOTRESOLVED);

