zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/radio/radio.c
	radio_bc_configure(bcc);
	radio_bc_status_reset();

	hal_trigger_aar_ppi_config();
	hal_radio_nrf_ppi_channels_enable(BIT(HAL_TRIGGER_AAR_PPI));
}

uint32_t radio_ar_match_get(void)
{
#if defined(EASYVDMA_PRESENT)
	return aar_job.status;
#else /* EASYVDMA_PRESENT */
	return NRF_AAR->STATUS;
#endif /* EASYVDMA_PRESENT */
}

void radio_ar_status_reset(void)
{
	radio_bc_status_reset();

	NRF_AAR->ENABLE = (AAR_ENABLE_ENABLE_Disabled << AAR_ENABLE_ENABLE_Pos) &
			  AAR_ENABLE_ENABLE_Msk;

	hal_radio_nrf_ppi_channels_disable(BIT(HAL_TRIGGER_AAR_PPI));
}

static void ar_end_wait(void)
{
	/* Blocking Address Resolution (AR) wait */

	/* An arbitrary iteration which seems sufficient testing on target with one IRK to resolve.
	 * We should ideally not be waiting anyway, and in theory be resolved before we are here.
	 */
	uint32_t countdown = 200U;

	while ((NRF_AAR->EVENTS_END == 0U) && (countdown != 0U)) {
		countdown--;

		/* We do not CPU sleep on select target SoCs but spin wait.
		 * For all other platforms, interrupt on END is enabled by the caller of this
		 * function, we will be woken up when the EVENTS_END occurs.
		 */
		if (!IS_ENABLED(CONFIG_SOC_SERIES_NRF54L) &&
		    !IS_ENABLED(CONFIG_SOC_SERIES_NRF54H)) {
			cpu_sleep();
		}
	}
}

uint32_t radio_ar_has_match(void)
{
	if (!radio_bc_has_match()) {
		return 0U;
	}

	nrf_aar_int_enable(NRF_AAR, AAR_INTENSET_END_Msk);

	ar_end_wait();

	nrf_aar_int_disable(NRF_AAR, AAR_INTENCLR_END_Msk);

	NVIC_ClearPendingIRQ(nrfx_get_irq_number(NRF_AAR));

	if (NRF_AAR->EVENTS_RESOLVED && !NRF_AAR->EVENTS_NOTRESOLVED) {
		return 1U;
	}

	return 0U;
}

uint8_t radio_ar_resolve(const uint8_t *addr)
{
	uint8_t retval;

	NRF_AAR->ENABLE = (AAR_ENABLE_ENABLE_Enabled << AAR_ENABLE_ENABLE_Pos) &
			  AAR_ENABLE_ENABLE_Msk;

#if defined(EASYVDMA_PRESENT)
	/* Input, Resolvable Address Hash offset in the supplied address buffer */
	aar_job.in[0].ptr = (void *)&addr[BDADDR_HASH_OFFSET];

	/* Input, Resolvable Address Prand offset in the supplied address buffer */
	aar_job.in[1].ptr = (void *)&addr[BDADDR_PRND_OFFSET];

	/* Reset match index to invalid value ( >= CONFIG_BT_CTLR_RL_SIZE ) */
	aar_job.status = UINT32_MAX;

	/* NOTE: Other `aar_job` structure members are initialized in `radio_ar_configure()` */

	NRF_AAR->IN.PTR = (uint32_t)&aar_job.in[0];
	NRF_AAR->OUT.PTR = (uint32_t)&aar_job.out[0];
	NRF_AAR->MAXRESOLVED = AAR_JOB_OUT_MAX_RESOLVED;

#else /* EASYVDMA_PRESENT */
	NRF_AAR->ADDRPTR = (uint32_t)addr - 3;
#endif /* EASYVDMA_PRESENT */

	nrf_aar_event_clear(NRF_AAR, NRF_AAR_EVENT_END);
	nrf_aar_event_clear(NRF_AAR, NRF_AAR_EVENT_RESOLVED);
	nrf_aar_event_clear(NRF_AAR, NRF_AAR_EVENT_NOTRESOLVED);

	NVIC_ClearPendingIRQ(nrfx_get_irq_number(NRF_AAR));

	nrf_aar_int_enable(NRF_AAR, AAR_INTENSET_END_Msk);

	nrf_aar_task_trigger(NRF_AAR, NRF_AAR_TASK_START);

	ar_end_wait();

	nrf_aar_int_disable(NRF_AAR, AAR_INTENCLR_END_Msk);

	NVIC_ClearPendingIRQ(nrfx_get_irq_number(NRF_AAR));

	retval = (NRF_AAR->EVENTS_RESOLVED && !NRF_AAR->EVENTS_NOTRESOLVED) ?
		 1U : 0U;

	NRF_AAR->ENABLE = (AAR_ENABLE_ENABLE_Disabled << AAR_ENABLE_ENABLE_Pos) &
			  AAR_ENABLE_ENABLE_Msk;

	return retval;

}
#endif /* CONFIG_BT_CTLR_PRIVACY */

#if defined(CONFIG_BT_CTLR_DF_SUPPORT) && !defined(CONFIG_ZTEST)
/* @brief Function configures CTE inline register to start sampling of CTE
 *        according to information parsed from CTEInfo field of received PDU.
 *
 * @param[in] cte_info_in_s1    Informs where to expect CTEInfo field in PDU:
 *                              in S1 for data pdu, not in S1 for adv. PDU
 */
void radio_df_cte_inline_set_enabled(bool cte_info_in_s1)
{
	const nrf_radio_cteinline_conf_t inline_conf = {
		.enable = true,
		/* Indicates whether CTEInfo is in S1 byte or not. */
		.info_in_s1 = cte_info_in_s1,
		/* Enable or disable switching and sampling when CRC is not OK. */
#if defined(CONFIG_BT_CTLR_DF_SAMPLE_CTE_FOR_PDU_WITH_BAD_CRC)
		.err_handling = true,
#else
		.err_handling = false,
#endif /* CONFIG_BT_CTLR_DF_SAMPLE_CTE_FOR_PDU_WITH_BAD_CRC */
		/* Maximum range of CTE time. 20 * 8us according to BT spec.*/
		.time_range = NRF_RADIO_CTEINLINE_TIME_RANGE_20,
		/* Spacing between samples for 1us AoD or AoA is set to 2us. */
		.rx1us = NRF_RADIO_CTEINLINE_RX_MODE_2US,
		/* Spacing between samples for 2us AoD or AoA is set to 4us. */
		.rx2us = NRF_RADIO_CTEINLINE_RX_MODE_4US,
		/* S0 bit pattern to match all types of adv. PDUs or CP bit in conn PDU*/
		.s0_pattern = (cte_info_in_s1 ? DF_S0_MASK_CP_BIT_IN_DATA_CHANNEL_PDU :
							DF_S0_ALLOW_ALL_PER_ADV_PDU),
		/* S0 bit mask set to don't match any bit in SO octet or match CP bit in conn PDU */
		.s0_mask = (cte_info_in_s1 ? DF_S0_MASK_CP_BIT_IN_DATA_CHANNEL_PDU :
							DF_S0_ALLOW_ALL_PER_ADV_PDU)
	};

	nrf_radio_cteinline_configure(NRF_RADIO, &inline_conf);
}
#endif /* CONFIG_BT_CTLR_DF_SUPPORT && !CONFIG_ZTEST */
